break_bread/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "category", "url", "rating", "photo", "person_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@restaurant = Restaurant.create(restaurant_params)