break_bread/app/controllers/users_controller.rb

  def create
      puts('user controller - create')
    @user = User.new(user_params)

    if @user.valid?
      @user.save()
---
INSERT INTO "users" ("name", "password_digest", "email", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"